[
    {
        "id": 0,
        "name": "Lassen's Resort", 
        "time": "ca. 1896-1944", 
        "description": [
            "The Lassen family came to Cedar Lake from Chicago in 1896. As boating enthusiasts, it was the lake that drew them here. Eldest son, Chris Lassen, began resort operations with a single steamboat that would ferry passengers between the Monon depot and the resort, as well as around the lake. He named the operation the Dewey Line after Admiral Dewey of the Spanish-American war. His fleet eventually grew to six boats with names like Big Dewey, Little Dewey, Steamer Dewey, and Baby Dewey. In 1902, a dance pavilion was built 300 feet off-shore by driving wood pilings into the lakebed and building the structure above. A restaurant was added on to the dance pavilion by 1912. The pier also included a tavern and a lunch counter and was the largest pier of its kind over a body of water in Indiana. ", 
            
            "In 1890, Armour Brothers & Company established ice interests at the lake's northwestern shore in the village of Armour. Each winter, the company took ice from the frozen lake to ship via the Monon railway to their meat-packing business in south Chicago. Three local carpenters, Nicholas Mager, Charles Wheeler and Kinzie Witter, built a boarding house for Armour's seasonal workforce. Near the end of WWI, Armour discontinued ice farming at Cedar Lake. Chris Lassen bought the boarding house to repurpose it as a hotel on his acreage. The building was gutted in the winter of 1919, put on sledges, and pulled across the frozen lake to its present site. Chris, along with his brothers Tom and Harry, dismantled the Armour ice barns and used the lumber to build the lakefront wing of the building in 1920. Lassen's Resort Hotel opened on May 7, 1921.", 
            
            "Lassen's Resort also included bath houses, a waterslide, diving platform, and swings in the lake, a duck pond, boat/automobile garage, six cottages, an orchard, and a miniature golf course. In 1944, Chris sold the property to the Lake Region Christian Assembly for use as a summer camp. In 1976, the Town of Cedar Lake purchased the grounds.", 
            
            "The Cedar Lake Historical Association organized in 1977 and leased the hotel from the town to establish a museum to present the relevance of Cedar Lake history. In 1980, the old Lassen Hotel was placed on the Indiana State Registry of Historic Places, and in 1981, on the National Register of Historic Places. It opened as the Lake of the Red Cedars Museum in October 1986. On May 7, 2021, on the occassion of the 100th Anniversary of the hotel's grand opening, it was re-themed as The Museum at Lassen's Resort to embrace its founding heritage. Visit lassensresort.org to discover the museum experiences that await you."]
    },
    {
        "id": 1,
        "name": "Binyon's Resort", 
        "time": "ca. 1877-1930s", 
        "description": [
            "John Binyon and his son, Christopher, purchased property in 1877 south of the dam at the Cedar Creek outlet, at the area now known as Binyon's Point, and established Binyon's Hotel. The first hotel was on the point, close to the water. At a later time, it was sold to Harry Clark, then to Luke Trotter.",

            "Christopher and his wife Flora had a two-story hotel built east of the original hotel in 1900. The resort had a good reputation and was known for its 25 cent chicken dinners, which cost 50 cents by 1920. Up to as many as 500 chickens were dressed each weekend and the resort frequently fed 200 guests at a time. Binyon's offered boating, with a boat house containing 50 boats, fishing, and was one of the few resorts that offered winter recreation such as ice skating. A ledger from the hotel shows 17 meals for a total of $3.10 and a room for $2.00 a week.",

            "By the 1940s, Christopher and Flora's son, Hal 'Bud' Binyon, had opened Binyon's Restaurant in Chicago and continued the tradition of family service to its customers until about 1987. There is no relation to the Binion family of casino fame."
        ]
    },
    {
        "id": 2,
        "name": "Toomey's Park", 
        "time": "ca. 1890-1970", 
        "description": [
            "South of Binyon's, John Toomey established a park about 1890. He constructed several buildings, including a hotel. He acquired the old Binyon School building and converted it into a dance hall. The park also included a tavern and beach. The hotel burned in the 1940s and was re-built. The park was closed in the 1970s. A fire in the 1990s claimed another of the historic structures."
        ]
    },
    {
        "id": 3,
        "name": "Shamrock Inn", 
        "time": "ca. 1890-1930s", 
        "description": [
            "At about 1890, Charles and Nellie Straight had a hotel here. It consisted of a restaurant and bar room on the main floor and guest rooms upstairs. They operated it until about 1920, when James Crocker became the new proprietor. It was well-known for its chicken dinners, boating, bathing, fishing and dancing. By the 1940s, Eugene and Geraldine Quinn purchased the property and became known as Quinn's Cottages."
        ]
    },
    {
        "id": 4,
        "name": "Sans Souci Hotel", 
        "time": "ca. 1884-1930s", 
        "description": [
            "Local builder, Charles Sigler, constructed this small hotel about 1884. The name is French for “without worries.” He and his wife, Martha, ran it until the early 1910s, when it was known briefly as Winkler's Hotel. In 1914, Ernst Krautwald became the next owner and it was again known as the Sans Souci Hotel. James Crocker was the last known owner in 1928. When Crocker purchased the hotel, he spent thousands of dollars modernizing it by adding more rooms and building a mezzanine balcony for dancing, which also provided a great view of the lake. The beautiful grounds had 260 feet of lake frontage. It was known for its steak and chicken dinners. Through its years it served as an escape for musicians. Legend has it that at one time Jazz musician, Paul Ash, climbed to the roof of the hotel at 5:00 A.M. and woke up the neighborhood when he played the “Wabash Blues."
        ]
    },
    {
        "id": 5,
        "name": "Olsen Hotels 1 and 2", 
        "time": "ca. 1880s-1930", 
        "description": [
            "At about the turn of the twentieth century, the Olsen family settled at this spot. They were boat builders and established a Norwegian Boat Club here, which included two hotels that served their guests at Cedar Lake for years."
        ]
    },
    {
        "id": 6,
        "name": "Surprise Park", 
        "time": "ca. 1928-1980s", 
        "description": [
            "The Peter Surprise family settled in south Lake County in the 1830s. Son, William, built a log cabin on the property. In 1928, William's son, Glenn, started Surprise Park. It featured a golf course, clubhouse built on piers over the water, and waterslide. The park also included amphibious plane rides. The ditch on the property was dug by Glenn using dynamite to have a water supply to water the golf course. U.S. Golf Architects, Inc. with the help of legendary golfer, Charles 'Chick' Evans, designed the 18-hole golf course. The park was closed during WWII. The property was sold a couple of times in the 1960s. Cecil and Mary Hays bought the property in the mid-1970s and it became South Shore Country Club. The clubhouse on the shoreline was built in 1980."
        ]
    },
    {
        "id": 7,
        "name": "Coffin's Shady Beach", 
        "time": "ca. 1919-1960s", 
        "description": [
            "Cordie Coffin and his mother, Emma, bought Obadiah Taylor, III's, land at the south end of Cedar Lake about 1916. The property stretched close to Cline Avenue and even included part of present-day Pine Crest Marina. Cordie left the area to serve in WWI and returned in 1919 to start Coffin's Shady Beach. Before the cabins were built, guests stayed in tents. By 1950, Cordie's son, Merritt, took over the resort. He added a steel-walled, two-story slide. A two-person cart with steel wheels was used on the waterslide, and a six-foot toboggan was used in the winter.  Merritt's son, Larry, and his wife, Sue, managed the resort for about six years. Coffin's Shady Beach became a private resort in the 1960s. Throughout the years, some parcels were sold. In 1990, Merritt's son, Terry, bought the resort and sold the last five acres about 2000. Beginning in 2006, five private residences were developed on the resort."
        ]
    },
    {
        "id": 8,
        "name": "Monon Park 1", 
        "time": "ca. 1881-1895", 
        "description": [
            "When the Monon Railroad was completed through Cedar Lake in 1881, railroad officials recognized Cedar Lake's beauty and its potential to be utilized like Lake Geneva, Wisconsin. The railroad created a recreation park at Cedar Lake to increase the ridership of their passenger trains and increase profits for the railroad. The first location of Monon Park was in what is now known as Noble Oaks Subdivision, on land once owned by John Du Breuill. The railroad leased the land from Mr. Du Breuill and asked him to build a pier and maintain 40 rowboats. He also built a hotel on his property and a dance hall. Monon Park served guests in a carnival style, with a midway and a variety of vendors selling cold drinks, ice cream and other novelties.",

            "The link to Chicago brought gamblers, pick-pockets, and other criminals on the Monon too. With the consumption of alcoholic beverages, fights were common. Chicago policemen came to police the area and they clashed with the jurisdiction of local authorities. By 1895, as many five passenger trains stopped here daily. Monon Park was becoming overcrowded. When Mr. Du Breuill died and his estate was being split up by his heirs, the railroad had to look for a new location."
        ]
    },
    {
        "id": 9,
        "name": "Webber/Paisley Hotel", 
        "time": "ca. 1879-1930s", 
        "description": [
            "Mark Webber built his two-story hotel about 1879. It was often referred to as the 'Paisley House' or 'Paisley Hotel' since it was located in the village of Paisley. The building was tucked into a sloping hill. A saloon with a long bar, barstools, and a row of spittoons were contained in the cellar. It also had five pool tables and a large storeroom in the back where goods were kept. Mr. Webber kept two steamboats and many fishing boats in a large boathouse on the lakeshore. The Webber Hotel was well-known for its home-cooked meals and a home-like atmosphere."
        ]
    },
    {
        "id": 10,
        "name": "Du Breuill Hotel", 
        "time": "ca. 1882-1920s", 
        "description": [
            "Soon after the Monon Railroad was completed in Lake County, officials approached landowner John Du Breuill to build a large, two-story hotel on his property along the lakeshore, north of the Webber/Paisley Hotel. The hotel had a dance floor and bar room on the first floor and guest rooms on the second floor. It sat on the first site of the Monon Park. During its Monon Park years, gambling, drinking, and fighting were common. By 1910, the building housed workers for the Anderson and Freeman Ice Company. It was demolished in the 1920s."
        ]
    },
    {
        "id": 11,
        "name": "John Mitch Hotel", 
        "time": "ca. 1890-1914", 
        "description": [
            "About 1890, John Mitch built a two-story, iron cross-beamed hotel southeast of the shopping center that was across from the Monon depot. Mr. Mitch felt that he was missing customer traffic, so he put the building on rollers and moved it south. The hotel had a saloon and the rooms had 9-foot high ceilings. According to a local legend, the black heavyweight champion boxer Jack Johnson stayed at the Mitch Hotel in the summer of 1909, while he trained at Cedar Lake for his 1910 bout with Jim Jeffries. Unfortunately, the hotel burned down during a large neighborhood fire in 1914, the same year that John died from being severely beaten by two drunk men whom he refused to serve."
        ]
    }
]